ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/TARGET_PSoC6_CY8C_CM0p/device/cy_device_headers.h
/***************************************************************************//**
* \file cy_device_headers.h
*
* \brief
* Common header file to be included by the drivers.
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CY_DEVICE_HEADERS_H_
#define _CY_DEVICE_HEADERS_H_

#if defined (CY8C622PSVP)
    #include "cy8c622psvp.h"
#elif defined (CY8C622PSVP_DUAL)
    #include "cy8c622psvp_dual.h"
#elif defined (CY8C616FMI_BL603)
    #include "cy8c616fmi_bl603.h"
#elif defined (CY8C616FMI_BL673)
    #include "cy8c616fmi_bl673.h"
#elif defined (CY8C616LQI_BL601)
    #include "cy8c616lqi_bl601.h"
#elif defined (CY8C616LQI_BL671)
    #include "cy8c616lqi_bl671.h"
#elif defined (CY8C617FMI_BL603)
    #include "cy8c617fmi_bl603.h"
#elif defined (CY8C617FMI_BLD73)
    #include "cy8c617fmi_bld73.h"
#elif defined (CY8C626FMI_BL603)
    #include "cy8c626fmi_bl603.h"
#elif defined (CY8C626BZI_BL604)
    #include "cy8c626bzi_bl604.h"
#elif defined (CY8C626BZI_BL674)
    #include "cy8c626bzi_bl674.h"
#elif defined (CY8C627BZI_BL604)
    #include "cy8c627bzi_bl604.h"
#elif defined (CY8C627FMI_BLD73)
    #include "cy8c627fmi_bld73.h"
#elif defined (CY8C627BZI_BLD74)
    #include "cy8c627bzi_bld74.h"
#elif defined (CY8C636BZI_BL604)
    #include "cy8c636bzi_bl604.h"
#elif defined (CY8C636BZI_BL674)
    #include "cy8c636bzi_bl674.h"
#elif defined (CY8C636FMI_BL603)
    #include "cy8c636fmi_bl603.h"
#elif defined (CY8C636FMI_BL673)
    #include "cy8c636fmi_bl673.h"
#elif defined (CY8C636LQI_BL601)
    #include "cy8c636lqi_bl601.h"
#elif defined (CY8C636LQI_BL671)
    #include "cy8c636lqi_bl671.h"
#elif defined (CY8C637BZI_BLD04)
    #include "cy8c637bzi_bld04.h"
#elif defined (CY8C637BZI_BLD74)
    #include "cy8c637bzi_bld74.h"
#elif defined (CY8C637FMI_BLD03)
    #include "cy8c637fmi_bld03.h"
#elif defined (CY8C637FMI_BLD73)
    #include "cy8c637fmi_bld73.h"
#elif defined (CY8C637LQI_BLD01)
    #include "cy8c637lqi_bld01.h"
#elif defined (CY8C637LQI_BLD71)
    #include "cy8c637lqi_bld71.h"
#elif defined (CY8C68237FM_BLE)
    #include "cy8c68237fm_ble.h"
#elif defined (CY8C68237BZ_BLE)
    #include "cy8c68237bz_ble.h"
#else
    #error Undefined part number
#endif

#endif /* _CY_DEVICE_HEADERS_H_ */


/* [] END OF FILE */
